sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
/**********************************************************************
    Mark Butcher    Bsc (Hons) MPhil MIET

    M.J.Butcher Consulting
    Birchstrasse 20f,    CH-5406, Rütihof
    Switzerland

    www.uTasker.com    Skype: M_J_Butcher

    ---------------------------------------------------------------------
    File:      app_hw_avr32.h
    Project:   uTasker Demonstration project
    ---------------------------------------------------------------------
    Copyright (C) M.J.Butcher Consulting 2004..2019
    *********************************************************************
    09.09.2009 Add EVK1100 configuration                                 {1}
    03.10.2009 Move "../../Hardware/AVR32/AVR32.h" include from types.h to this file, after detailed chip defines {2}
    05.10.2009 Add CGLCD_GLCD_MODE configuration                         {3}
    06.10.2009 Add GLCD configuration for Samsung based GLCD             {4}
    16.10.2009 Add NUMBER_EXTERNAL_SERIAL when serial interface active   {5}
    18.11.2009 Add dummy TICK_INTERRUPT() for compatibility              {6}
    18.11.2009 Add EVK1101 setup and _AT32UC3B support                   {7}
    24.12.2009 Add SD-card interface                                     {8}
    22.02.2010 Correct SPI_FLASH_AT45DB161, SPI_FLASH_AT45DB321 and SPI_FLASH_AT45DB642 sizes {9}
    05.06.2010 Add USB device                                            {10}
    14.09.2010 Add SPI FLASH setup                                       {11}
    04.05.2011 Add GET_SDCARD_WP_STATE()                                 {12}
    19.06.2011 Add AVR32_AT32UC3C_EK                                     {13}
    19.07.2012 Add keypad and frontpanel support                         {14}
    19.07.2012 Add MONITOR_PERFORMANCE support                           {15}
    30.11.2012 Add AVR32_UC3_C2_XPLAINED support                         {16}

    Application specific hardware configuration
*/

#if defined _HW_AVR32
#if !defined __APP_HW_AVR32__
#define __APP_HW_AVR32__

#if defined _WINDOWS
    #define _SIM_PORTS fnSimPorts(-1)
#else
    #define _SIM_PORTS
#endif

#if defined _AT32UC3B                                                    // {7}
  //#define CHIP_48_PIN
    #define CHIP_64_PIN
    #define SIZE_OF_FLASH          (256 * 1024)                          // modify to suit the device used
    #define SIZE_OF_RAM            (32 * 1024)
#elif defined _AT32UC3C                                                  // {13}
    #if defined AVR32_UC3_C2_XPLAINED
        #define CHIP_64_PIN
    #else
      //#define CHIP_64_PIN
      //#define CHIP_100_PIN
        #define CHIP_144_PIN
    #endif
    #define SIZE_OF_FLASH          (512 * 1024)                          // modify to suit the device used
    #define SIZE_OF_RAM            (64 * 1024)
#else
  //#define CHIP_100_PIN
    #define CHIP_144_PIN
    #define SIZE_OF_FLASH          (512 * 1024)                          // modify to suit the device used
    #define SIZE_OF_RAM            (64 * 1024)
#endif


#include "../../Hardware/AVR32/AVR32.h"


#define RETRIG_WDOG_DURING_ERASE                                         // if large files (or *.* by FTP) are used, it is desirable to retrigger the watchdog during the process

//#define RUN_FROM_RC_OSCILLATOR                                         // run from RC oscillator

#if defined RUN_FROM_RC_OSCILLATOR
    #define SLOW_CLOCK             115000                                // RC oscillator
    #define PLL_OUTPUT_FREQ_INT    SLOW_CLOCK
    #define BUS_DIVIDES            0
    #define CPU_HSB_DIVIDE         1
    #define PBA_DIVIDE             1
    #define PBB_DIVIDE             1
    #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
        #define HSB_DIVIDE         1
        #define PBC_DIVIDE         1
    #endif
#else
    #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
        #define CRYSTAL_FREQ       16000000                              // main clock
        #define OSC_STARTUP_TIME   STARTUP_18MS                          // recommended startup time for this crystal
    #else
        #define CRYSTAL_FREQ       12000000                              // main clock
        #define OSC_STARTUP_TIME   STARTUP_18MS                          // recommended startup time for this crystal
    #endif
  //#define DISABLE_PLL                                                  // don't enable the PLL and so run at input clock speed

    #define LOCK_COUNT             16                                    // the number of slow clocks before lock is declared - recommended value
    #define OSC_DIVIDE             1                                     // 1..15
    #ifdef USB_INTERFACE                                                 // {10} set 48MHz CPU speed to allow USB operation
        #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
            #define PLL_MUL        6                                     // 3..16
            #define POST_DIVIDE    2                                     // 1..2
        #else
            #define PLL_MUL        8                                     // 3..16
            #define POST_DIVIDE    2                                     // 1..2
        #endif
    #else
        #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED   // 66MHz maximum
            #define PLL_MUL        8                                     // 3..16
            #define POST_DIVIDE    1                                     // 1..2
        #elif defined _AT32UC3B                                          // {7} 60 MHz maximum
            #define PLL_MUL        10                                    // 3..16
            #define POST_DIVIDE    1                                     // 1..2
        #else                                                            // 66MHz maximum
            #define PLL_MUL        11                                    // 3..16
            #define POST_DIVIDE    1                                     // 1..2
        #endif
    #endif
    #if defined DISABLE_PLL
        #define CPU_HSB_DIVIDE     1
        #define PBB_DIVIDE         1
        #define PBA_DIVIDE         1
        #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
            #define HSB_DIVIDE     1
            #define PBC_DIVIDE     1
        #endif
    #elif defined USB_INTERFACE
        #define CPU_HSB_DIVIDE     1                                     // CPU runs with 48MHz to satisfy USB from single PLL
        #define PBB_DIVIDE         1                                     // PBB bus runs with 48MHz [reducing to unequal CPU_HSB_DIVIDE stops FLASH programming from working. It is generally recommended to keep PBB equal to HSB]
        #define PBA_DIVIDE         2                                     // PBA bus runs with 24MHz
        #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
            #define HSB_DIVIDE     1
            #define PBC_DIVIDE     2
        #endif
    #else
        #define CPU_HSB_DIVIDE     2                                     // CPU runs with 66MHz (assuming highest speed and AT32UC3A)
        #define PBB_DIVIDE         2                                     // PBB bus runs with 66MHz [reducing to unequal CPU_HSB_DIVIDE stops FLASH programming from working. It is generally recommended to keep PBB equal to HSB]
        #define PBA_DIVIDE         4                                     // PBA bus runs with 33MHz
        #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
            #define HSB_DIVIDE     2
            #define PBC_DIVIDE     2
        #endif
    #endif

    #if !defined DISABLE_PLL
        // Rules for setting the frequency
        // The crystal must be between 0.45 and 16MHz (0.4 and 20MHz for _AT32UC3C)
        // The input can be divided by between 1 and 15
        // The PLL can multiply by between 3 and 16
        // The PLL frequency must normally be in the range 80MHz and 240MHz
        // The PLL output frequency is equal to ((CRYSTAL_FREQ / OSC_DIVIDE) * PLL_MUL)
        // The system clock is equal to PLL output frequency divided by POST_DIVIDE
        // The possible CPU/HSB/PBA and PBB divide values are 1,2,4,8,16,32,64,128,256
        // The compiler throws an error if any setting is out of range

        #if (POST_DIVIDE != 2) && (POST_DIVIDE != 1)
            #error master clock post divider has an illegal value (must be 1 or 2)
        #else
            #if POST_DIVIDE == 2
                #define POST_DIVIDE_OPTION   PLLOPTION_OUTPUT_DIV2
            #else
                #define POST_DIVIDE_OPTION   0
            #endif
        #endif

        #if CRYSTAL_FREQ < 450000 || CRYSTAL_FREQ > 16000000
            #error Crystal frequency out of range: must be between 450kHz and 16MHz
        #endif

        #define _PLL_OUTPUT_FREQ     ((CRYSTAL_FREQ/OSC_DIVIDE)*PLL_MUL)
        #define PLL_OUTPUT_FREQ_INT  (_PLL_OUTPUT_FREQ/POST_DIVIDE)

        #if (_PLL_OUTPUT_FREQ < 80000000) || (_PLL_OUTPUT_FREQ > 240000000)
            #error PLL frequency out of range: PLL output frequency must be within 80 and 240MHz
        #endif

        #if (LOCK_COUNT > 63)
            #error PLL lock count range 0..63
        #endif

