sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
        #if _PLL_OUTPUT_FREQ >= START_HIGH_PLL_OUTPUT_RANGE
            #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
                #define PLL_SETTING (SCIF_PLL_PLLOPT_VCO_160_240MHZ | POST_DIVIDE_OPTION | SCIF_PLL_PLLOPT_WIDE_BANDWITH_MODE_ENABLED | ((PLL_MUL - 1) << 16) | (OSC_DIVIDE << 8) | (LOCK_COUNT << 24))     
            #else
                #define PLL_SETTING (PLLOPTION_RANGE_160_240MHZ | POST_DIVIDE_OPTION | ((PLL_MUL - 1) << 16) | (OSC_DIVIDE << 8) | (LOCK_COUNT << 24))
            #endif
        #else
            #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
                #define PLL_SETTING (SCIF_PLL_PLLOPT_VCO_80_180MHZ | POST_DIVIDE_OPTION | SCIF_PLL_PLLOPT_WIDE_BANDWITH_MODE_ENABLED | ((PLL_MUL - 1) << 16) | (OSC_DIVIDE << 8) | (LOCK_COUNT << 24))
            #else
                #define PLL_SETTING (PLLOPTION_RANGE_80_180MHZ | POST_DIVIDE_OPTION | ((PLL_MUL - 1) << 16) | (OSC_DIVIDE << 8) | (LOCK_COUNT << 24))
            #endif
        #endif
    #else
        #define PLL_OUTPUT_FREQ_INT    CRYSTAL_FREQ
    #endif

    #if defined _AT32UC3B && ((PLL_OUTPUT_FREQ_INT/CPU_HSB_DIVIDE) > 60000000) // {7}
        #error master clock frequency too high: maximum 60MHz for AT32UC3B
    #elif ((PLL_OUTPUT_FREQ_INT/CPU_HSB_DIVIDE) > 66000000)
        #error master clock frequency too high: maximum 66MHz
    #endif

    #if CPU_HSB_DIVIDE > 1
        #if CPU_HSB_DIVIDE == 2
            #define CPU_DIV  (CPU_DIV_2 | HSB_DIV_2)
        #elif CPU_HSB_DIVIDE == 4
            #define CPU_DIV  (CPU_DIV_4 | HSB_DIV_4)
        #elif CPU_HSB_DIVIDE == 8
            #define CPU_DIV  (CPU_DIV_8 | HSB_DIV_8)
        #elif CPU_HSB_DIVIDE == 16
            #define CPU_DIV  (CPU_DIV_16 | HSB_DIV_16)
        #elif CPU_HSB_DIVIDE == 32
            #define CPU_DIV  (CPU_DIV_32 | HSB_DIV_32)
        #elif CPU_HSB_DIVIDE == 64
            #define CPU_DIV  (CPU_DIV_64 | HSB_DIV_64)
        #elif CPU_HSB_DIVIDE == 128
            #define CPU_DIV  (CPU_DIV_128 | HSB_DIV_128)
        #elif CPU_HSB_DIVIDE == 256
            #define CPU_DIV  (CPU_DIV_256 | HSB_DIV_256)
        #else
             #error illegal CPU divide value: requires power of two and maximum 256
        #endif
    #else
        #define CPU_DIV  0
    #endif

    #if PBA_DIVIDE > 1
        #if PBA_DIVIDE == 2
            #define PBA_DIV  PBA_DIV_2
        #elif PBA_DIVIDE == 4
            #define PBA_DIV  PBA_DIV_4
        #elif PBA_DIVIDE == 8
            #define PBA_DIV  PBA_DIV_8
        #elif PBA_DIVIDE == 16
            #define PBA_DIV  PBA_DIV_16
        #elif PBA_DIVIDE == 32
            #define PBA_DIV  PBA_DIV_32
        #elif PBA_DIVIDE == 64
            #define PBA_DIV  PBA_DIV_64
        #elif PBA_DIVIDE == 128
            #define PBA_DIV  PBA_DIV_128
        #elif PBA_DIVIDE == 256
            #define PBA_DIV  PBA_DIV_256
        #else
            #error illegal PBA divide value: requires power of two and maximum 256
        #endif
    #else
        #define PBA_DIV  0
    #endif

    #if PBB_DIVIDE > 1
        #if PBB_DIVIDE == 2
            #define PBB_DIV  PBB_DIV_2
        #elif PBB_DIVIDE == 4
            #define PBB_DIV  PBB_DIV_4
        #elif PBB_DIVIDE == 8
            #define PBB_DIV  PBB_DIV_8
        #elif PBB_DIVIDE == 16
            #define PBB_DIV  PBB_DIV_16
        #elif PBB_DIVIDE == 32
            #define PBB_DIV  PBB_DIV_32
        #elif PBB_DIVIDE == 64
            #define PBB_DIV  PBB_DIV_64
        #elif PBB_DIVIDE == 128
            #define PBB_DIV  PBB_DIV_128
        #elif PBB_DIVIDE == 256
            #define PBB_DIV  PBB_DIV_256
        #else
            #error illegal PBA divide value: requires power of two and maximum 256
        #endif
    #else
        #define PBB_DIV  0
    #endif

    #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
        #if HSB_DIVIDE > 1
            #if HSB_DIVIDE == 2
                #define HSB_DIV  HSB_DIV_2
            #elif HSB_DIVIDE == 4
                #define HSB_DIV  HSB_DIV_4
            #elif HSB_DIVIDE == 8
                #define HSB_DIV  HSB_DIV_8
            #elif HSB_DIVIDE == 16
                #define HSB_DIV  HSB_DIV_16
            #elif HSB_DIVIDE == 32
                #define HSB_DIV  HSB_DIV_32
            #elif HSB_DIVIDE == 64
                #define HSB_DIV  HSB_DIV_64
            #elif HSB_DIVIDE == 128
                #define HSB_DIV  HSB_DIV_128
            #elif HSB_DIVIDE == 256
                #define HSB_DIV  HSB_DIV_256
            #else
                #error illegal PBA divide value: requires power of two and maximum 256
            #endif
        #else
            #define HSB_DIV  0
        #endif

        #if PBC_DIVIDE > 1
            #if PBC_DIVIDE == 2
                #define PBC_DIV  PBC_DIV_2
            #elif PBC_DIVIDE == 4
                #define PBC_DIV  PBC_DIV_4
            #elif PBC_DIVIDE == 8
                #define PBC_DIV  PBC_DIV_8
            #elif PBC_DIVIDE == 16
                #define PBC_DIV  PBC_DIV_16
            #elif PBC_DIVIDE == 32
                #define PBC_DIV  PBC_DIV_32
            #elif PBC_DIVIDE == 64
                #define PBC_DIV  PBC_DIV_64
            #elif PBC_DIVIDE == 128
                #define PBC_DIV  PBC_DIV_128
            #elif PBC_DIVIDE == 256
                #define PBC_DIV  PBC_DIV_256
            #else
                #error illegal PBA divide value: requires power of two and maximum 256
            #endif
        #else
            #define PBC_DIV  0
        #endif
    #endif

    #define BUS_DIVIDES  (CPU_DIV | PBA_DIV | PBB_DIV)                   // bus clock divider register setting (used by _AT32UC3A and _AT32UC3B)
#endif

// SPI FLASH system setup
//
#if defined SPI_FILE_SYSTEM && !defined FLASH_FILE_SYSTEM
    #define uFILE_START 0x0
    #define EEPROM_32K                                                   // device size used
#else
    #define FILES_ADDRESSABLE                                            // file system is addressable (doesn't have to be retrieved)
#endif

