sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
#if defined AVR32_EVK1100 || defined AVR32_AT32UC3C_EK                   // these boards have SPI flash connected to SPI1 (others to SPI0)
    #define USE_SPI1_FOR_SPI_FLASH
#endif

// Use SPI0 and control CS0 as port output (also enable clocks to the port) {11}
//
#ifdef USE_SPI1_FOR_SPI_FLASH                                            // when SPI1 is connected to SPI FLASH
    #if defined AVR32_EVK1100                                            // CS on PA10
        #define CS_OUTPUT           PA10
        #define CONFIG_SPI_PORTS()  POWER_UP(PBA, PBAMASK_SPI1); \
                                    _CONFIG_PERIPHERAL_B(0, (SPI1_MISO_B | SPI1_MOSI_B | SPI1_SCK_B)); \
                                    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(0, CS_OUTPUT, CS_OUTPUT);
        #define SPI_FLASH_PORT_CLR  OVRC_0
        #define SPI_FLASH_PORT_SET  OVRS_0

        #define SPI_CS0_PORT        OVR_0                                // for simulator compatibility
    #elif defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED     // CS on PB24
        #define CS_OUTPUT           PB24
        #define CONFIG_SPI_PORTS()  POWER_UP(PBA, PBAMASK_SPI1); \
                                    _CONFIG_PERIPHERAL_B(0, (SPI1_MISO_B | SPI1_MOSI_B | SPI1_SCK_B)); \
                                    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, CS_OUTPUT, CS_OUTPUT);
        #define SPI_FLASH_PORT_CLR  OVRC_1
        #define SPI_FLASH_PORT_SET  OVRS_1

        #define SPI_CS0_PORT        OVR_1                                // for simulator compatibility
    #endif

    #define POWER_SPI()           //POWER_UP(PBA, PBAMASK_SPI1)          // enable clocks to SPI1
    #define REMOVE_POWER_SPI()      POWER_DOWN(PBA, PBAMASK_SPI1)        // disable clocks to SPI1

    #define SPI_MR                  SPI_MR_1                             // map to SPI1
    #define SPI_CSR0                SPI_CSR0_1
    #define SPI_CR                  SPI_CR_1
    #define SPI_TDR                 SPI_TDR_1
    #define SPI_SR                  SPI_SR_1
    #define SPI_RDR                 SPI_RDR_1
#else                                                                    // else SPI0 is connected to SPI FLASH
    #if defined AVR32_EVK1105
        #define CS_OUTPUT           PA10
    #elif defined AVR32_EVK1101
        #define CS_OUTPUT           PA16
    #elif defined AVR32_EVK1104
        #define CS_OUTPUT           PA14
    #elif defined AVR32_UC3_C2_XPLAINED
        #define CS_OUTPUT           PC16
    #endif
    #if defined AVR32_UC3_C2_XPLAINED
        #define CONFIG_SPI_PORTS()  POWER_UP(PBC, PBCMASK_SPI0); \
                                    _CONFIG_PERIPHERAL_A(3, (SPI0_MISO_0_A | SPI0_MOSI_0_A | SPI0_SCK_1_A)); \
                                    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(2, CS_OUTPUT, CS_OUTPUT);

        #define SPI_FLASH_PORT_CLR  OVRC_2
        #define SPI_FLASH_PORT_SET  OVRS_2

        #define POWER_SPI()         //POWER_UP(PBC, PBCMASK_SPI0)        // enable clocks to SPI0
        #define REMOVE_POWER_SPI()  POWER_DOWN(PBC, PBCMASK_SPI0)        // disable clocks to SPI0


        #define SPI_CS0_PORT        OVR_2                                // for simulator compatibility
    #else
        #define CONFIG_SPI_PORTS()  POWER_UP(PBA, PBAMASK_SPI0); \
                                    _CONFIG_PERIPHERAL_A(0, (SPI0_MISO_A | SPI0_MOSI_A | SPI0_SCK_A)); \
                                    _CONFIG_DRIVE_PORT_OUTPUT_VALUE(0, CS_OUTPUT, CS_OUTPUT);

        #define SPI_FLASH_PORT_CLR  OVRC_0
        #define SPI_FLASH_PORT_SET  OVRS_0

        #define POWER_SPI()         //POWER_UP(PBA, PBAMASK_SPI0)        // enable clocks to SPI0
        #define REMOVE_POWER_SPI()  POWER_DOWN(PBA, PBAMASK_SPI0)        // disable clocks to SPI0

        #define SPI_CS0_PORT        OVR_0                                // for simulator compatibility
    #endif
    #define SPI_MR                  SPI_MR_0                             // map to SPI0
    #define SPI_CSR0                SPI_CSR0_0
    #define SPI_CR                  SPI_CR_0
    #define SPI_TDR                 SPI_TDR_0
    #define SPI_SR                  SPI_SR_0
    #define SPI_RDR                 SPI_RDR_0
#endif

#define CS0_LINE               CS_OUTPUT                                 // CS0 line used when SPI FLASH is enabled
//#define CS1_LINE             SPI_CS0_1                                 // CS1 line used when extended SPI FLASH is enabled
//#define CS2_LINE             SPI_CS0_2                                 // CS2 line used when extended SPI FLASH is enabled
//#define CS3_LINE             SPI_CS0_3                                 // CS3 line used when extended SPI FLASH is enabled

#if defined SPI_FLASH_ST                                                 // ST SPI FLASH used
  //#define SPI_FLASH_STM25P40                                           // the available ST chips
    #define SPI_FLASH_STM25P80
  //#define SPI_FLASH_STM25P16
  //#define SPI_FLASH_STM25P32
  //#define SPI_FLASH_STM25P64

    #if defined SPI_FLASH_STM25P40                                       // 512k
        #define SPI_FLASH_PAGES             (8 * 256)
    #elif defined SPI_FLASH_STM25P80                                     // 1M
        #define SPI_FLASH_PAGES             (16 * 256)
    #elif defined SPI_FLASH_STM25P16                                     // 2M
        #define SPI_FLASH_PAGES             (32 * 256)
    #elif defined SPI_FLASH_STM25P32                                     // 4M
        #define SPI_FLASH_PAGES             (64 * 256)
    #elif defined SPI_FLASH_STM25P64                                     // 8M
        #define SPI_FLASH_PAGES             (128 * 256)
    #endif

    #define SPI_FLASH_PAGE_LENGTH 256
    #ifdef SPI_DATA_FLASH
        #define SPI_FLASH_SECTOR_LENGTH (16 * SPI_FLASH_PAGE_LENGTH)     // sub-sector size of data FLASH
    #else
        #define SPI_FLASH_SECTOR_LENGTH (256 * SPI_FLASH_PAGE_LENGTH)    // sector size of code FLASH
    #endif
    #define SPI_FLASH_BLOCK_LENGTH  SPI_FLASH_SECTOR_LENGTH
#elif defined SPI_FLASH_SST25
    #define SPI_FLASH_SST25VF010A                                        // the supported SST chips
  //#define SPI_FLASH_SST25LF020A
  //#define SPI_FLASH_SST25LF040A
  //#define SPI_FLASH_SST25VF040B
  //#define SPI_FLASH_SST25VF080B
  //#define SPI_FLASH_SST25VF016B
  //#define SPI_FLASH_SST25VF032B

    #if defined SPI_FLASH_SST25VF010A                                    // 1Mbit (128k)
        #define SST25_A_VERSION
        #define SPI_FLASH_PAGES             (32)
    #elif defined SPI_FLASH_SST25LF020A                                  // 2Mbit (256k)
        #define SST25_A_VERSION
        #define SPI_FLASH_PAGES             (64)
    #elif defined SPI_FLASH_SST25LF040A                                  // 4Mbit (512k)
        #define SST25_A_VERSION
        #define SPI_FLASH_PAGES             (128)
    #elif defined SPI_FLASH_SST25VF040B                                  // 4Mbit (512k)
        #define SPI_FLASH_PAGES             (128)
    #elif defined SPI_FLASH_SST25VF080B                                  // 8Mbit (1M)
        #define SPI_FLASH_PAGES             (256)
    #elif defined SPI_FLASH_SST25VF016B                                  // 16Mbit (2M)
        #define SPI_FLASH_PAGES             (512)
    #elif defined SPI_FLASH_SST25VF032B                                  // 32Mbit (4M)
        #define SPI_FLASH_PAGES             (1024)
    #endif

