sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
    #define SPI_FLASH_SUB_SECTOR_LENGTH  (4 * 1024)                      // sub-sector size of SPI FLASH
    #define SPI_FLASH_HALF_SECTOR_LENGTH (32 * 1024)                     // half-sector size of SPI FLASH
    #define SPI_FLASH_SECTOR_LENGTH      (64 * 1024)                     // sector size of SPI FLASH (not available on A-versions)

    #define SPI_FLASH_PAGE_LENGTH        SPI_FLASH_SUB_SECTOR_LENGTH     // for compatibility - smallest erasable block
    #define SPI_FLASH_BLOCK_LENGTH       SPI_FLASH_SUB_SECTOR_LENGTH     // for compatibility - file system granularity
#else                                                                    // example set up for AT45DB321C on ATMEL Eval board
  //#define SPI_FLASH_AT45DB011                                          // define the ATMEL type used here
  //#define SPI_FLASH_AT45DB021
  //#define SPI_FLASH_AT45DB041
  //#define SPI_FLASH_AT45DB081
  //#define SPI_FLASH_AT45DB161
  //#define SPI_FLASH_AT45DB321
    #define SPI_FLASH_AT45DB642                                          // note that this is used the EVK1100
    #define SPI_FLASH_AT45XXXXD_TYPE                                     // specify that a D-type rather than a B/C type is being used

    #if defined SPI_FLASH_AT45DB642                                      // define whether used in power of 2 mode or not
        #define SPI_FLASH_PAGE_LENGTH 1056                               // standard page size (B-device only allows 1056)
      //#define SPI_FLASH_PAGE_LENGTH 1024                               // size when power of 2 mode selected (only possible on D-device) - warning: this mode will be set and is not reversible!! (requires a power-cycle the first time after being set)
        #define SPI_FLASH_PAGES             (8 * 1024)                   // 8Meg part {9}
    #elif defined SPI_FLASH_AT45DB321 || defined SPI_FLASH_AT45DB161
        #define SPI_FLASH_PAGE_LENGTH 528                                // standard page size (B/C-device only allows 528)
      //#define SPI_FLASH_PAGE_LENGTH 512                                // size when power of 2 mode selected (only possible on D-device)
        #if defined SPI_FLASH_AT45DB161
            #define SPI_FLASH_PAGES         (4 * 1024)                   // 2Meg part {9}
        #else
            #define SPI_FLASH_PAGES         (8 * 1024)                   // 4Meg part {9}
        #endif
    #else
        #define SPI_FLASH_PAGE_LENGTH 264                                // standard page size (B-device only allows 264)
      //#define SPI_FLASH_PAGE_LENGTH 256                                // size when power of 2 mode selected (only possible on D-device)
        #if defined SPI_FLASH_AT45DB011
            #define SPI_FLASH_PAGES         (512)                        // 128k part
        #elif defined SPI_FLASH_AT45DB021
            #define SPI_FLASH_PAGES         (1024)                       // 256k part
        #elif defined SPI_FLASH_AT45DB041
            #define SPI_FLASH_PAGES         (2 * 1024)                   // 512k part
        #elif defined SPI_FLASH_AT45DB081
            #define SPI_FLASH_PAGES         (4 * 1024)                   // 1Meg part
        #endif
    #endif

    #define SPI_FLASH_BLOCK_LENGTH  (8 * SPI_FLASH_PAGE_LENGTH)          // block size - a block can be deleted
    #define SPI_FLASH_SECTOR_LENGTH (64 * 4 * SPI_FLASH_PAGE_LENGTH)     // exception sector 0a is 2k and sector 0b is 62k
#endif

#define SPI_FLASH_DEVICE_COUNT  1                                        // only define CSX_LINE for this amount of devices
#define SPI_DATA_FLASH_0_SIZE   (SPI_FLASH_PAGES*SPI_FLASH_PAGE_LENGTH)
#define SPI_DATA_FLASH_1_SIZE   (SPI_FLASH_PAGES*SPI_FLASH_PAGE_LENGTH)
#define SPI_DATA_FLASH_2_SIZE   (SPI_FLASH_PAGES*SPI_FLASH_PAGE_LENGTH)
#define SPI_DATA_FLASH_SIZE     (SPI_DATA_FLASH_0_SIZE /* + SPI_DATA_FLASH_1_SIZE + SPI_DATA_FLASH_2_SIZE*/)

#define SW_UPLOAD_FILE()       (*ucIp_Data == 'z') && (*(ucIp_Data+1) == 'S') && (*(ucIp_Data+2) == '.')  && (fnSPI_Flash_available() != 0)


#define SET_SPI_FLASH_MODE()                                             // dummy for compatibility
#define REMOVE_SPI_FLASH_MODE()                                          // dummy for compatibility


#ifdef SDCARD_SUPPORT                                                    // {8}
    #define SDCARD_SIM_SIZE   SDCARD_SIZE_2G                             // the size of SD card when simulating
  //#define _NO_SD_CARD_INSERTED                                         // simulate no SD card inserted initially
    #define T_CHECK_CARD_REMOVAL    ((DELAY_LIMIT)(SEC * 10))            // if the card has no detection switch it can be polled to detect removal
  //#define SDCARD_DETECT_INPUT_POLL                                     // use card detect switch for detection polling (use together with T_CHECK_CARD_REMOVAL)
  //#define SDCARD_DETECT_INPUT_INTERRUPT                                // use card detect switch for detection by interrupt (T_CHECK_CARD_REMOVAL and SDCARD_DETECT_INPUT_POLL should be disabled)
    #if defined SDCARD_DETECT_INPUT_INTERRUPT && !defined SUPPORT_PORT_INTERRUPTS
        #define SUPPORT_PORT_INTERRUPTS
    #endif
    #if defined AVR32_EVK1100
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_1                  PA18
        #define INITIALISE_SPI_SD_INTERFACE() \
            POWER_UP(PBA, PBAMASK_SPI1); \
            _CONFIG_PERIPHERAL_B(0, (SPI1_MISO_B | SPI1_MOSI_B | SPI1_SCK_B)); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(0, SPI_CS1_1, SPI_CS1_1); \
            SPI_MR_1 = (SPI_MSTR | MODFDIS | SPI_CS_0); \
            SPI_CSR0_1 = (SPI_CPOL | SPI_8_BITS | (((MASTER_CLOCK + 300000/2)/300000) << 8));
          //SPI_CR_1 = SPIEN

        #define ENABLE_SPI_SD_OPERATION() SPI_CR_1 = SPIEN               // workaround for GCC problem (it otherwise puts this command at the start of the INITIALISE_SPI_SD_INTERFACE() sequence)
        #define SET_SD_CARD_MODE()

        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED()  SPI_CSR0_1 = (SPI_CPOL | SPI_8_BITS | (((MASTER_CLOCK + 6000000/2)/6000000) << 8));

        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)    SPI_TDR_1 = (unsigned char)byte; SPI_RDR_1 = _fnSimSD_write((unsigned char)SPI_TDR_1)
            #define WAIT_TRANSMISSON_END() while (!(SPI_SR_1 & SPI_RDRF)) {SPI_SR_1 |= SPI_RDRF;};
        #else
            #define WRITE_SPI_CMD(byte)    SPI_TDR_1 = (unsigned char)byte
            #define WAIT_TRANSMISSON_END() while (!(SPI_SR_1 & SPI_RDRF)) {};
        #endif
        #define READ_SPI_DATA()        (unsigned char)SPI_RDR_1

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()  _SETBITS(0, SPI_CS1_1)              // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()      _CLEARBITS(0, SPI_CS1_1)            // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()     _SETBITS(0, SPI_CS1_1)              // negate the CS line of the SD card to be read
        #define GET_SDCARD_WP_STATE() 0                                  // {12} write protection disabled (change to read switch if required)
    #elif defined AVR32_EVK1101
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_0                  PA17
        #define SPI_CARD_DETECT            PB00
        #define SPI_WRITE_PROTECT_INPUT    PB01
        #define INITIALISE_SPI_SD_INTERFACE() \
            POWER_UP(PBA, PBAMASK_SPI0); \
            _CONFIG_PORT_INPUT(1, (SPI_WRITE_PROTECT_INPUT | SPI_CARD_DETECT)); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(0, SPI_CS1_0, SPI_CS1_0); \
            _CONFIG_PERIPHERAL_A(0, (SPI0_MISO_A | SPI0_MOSI_A | SPI0_SCK_A)); \
            SPI_MR_0 = (SPI_MSTR | MODFDIS | SPI_CS_0); \
            SPI_CSR0_0 = (SPI_CPOL | SPI_8_BITS | (((MASTER_CLOCK + 300000/2)/300000) << 8));
          //SPI_CR_0 = SPIEN

        #define ENABLE_SPI_SD_OPERATION() SPI_CR_0 = SPIEN               // workaround for GCC problem (it otherwise puts this command at the start of the INITIALISE_SPI_SD_INTERFACE() sequence)
        #define SET_SD_CARD_MODE()

        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED()  SPI_CSR0_0 = (SPI_CPOL | SPI_8_BITS | (((MASTER_CLOCK + 6000000/2)/6000000) << 8));

        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)    SPI_TDR_0 = (unsigned char)byte; SPI_RDR_0 = _fnSimSD_write((unsigned char)SPI_TDR_0)
            #define WAIT_TRANSMISSON_END() while (!(SPI_SR_0 & SPI_RDRF)) {SPI_SR_0 |= SPI_RDRF;};
        #else
            #define WRITE_SPI_CMD(byte)    SPI_TDR_0 = (unsigned char)byte
            #define WAIT_TRANSMISSON_END() while (!(SPI_SR_0 & SPI_RDRF)) {};
        #endif
        #define READ_SPI_DATA()        (unsigned char)SPI_RDR_0

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()  _SETBITS(0, SPI_CS1_0)              // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()      _CLEARBITS(0, SPI_CS1_0)            // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()     _SETBITS(0, SPI_CS1_0)              // negate the CS line of the SD card to be read
        #define GET_SDCARD_WP_STATE() (!(_READ_PORT_MASK(1, SPI_WRITE_PROTECT_INPUT))) // write protection input
        #define SDCARD_DETECTION()   _READ_PORT_MASK(1, SPI_CARD_DETECT) // card detection input

        #define SDCARD_DETECT_PORT   PORT_1                              // card detection input defines when using interrupts
        #define SDCARD_DETECT_PIN    SPI_CARD_DETECT
    #elif defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED     // {13}
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_0                  PB22
        #define INITIALISE_SPI_SD_INTERFACE() \
            POWER_UP(PBA, PBAMASK_SPI1); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, SPI_CS1_0, SPI_CS1_0); \
            _CONFIG_PERIPHERAL_B(1, (SPI1_MISO_1_B | SPI1_MOSI_1_B | SPI1_SCK_1_B)); \
            SPI_MR_1 = (SPI_MSTR | MODFDIS | SPI_CS_0); \
            SPI_CSR0_1 = (SPI_CPOL | SPI_8_BITS | (((MASTER_CLOCK + 300000/2)/300000) << 8))

