sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
        #define ENABLE_SPI_SD_OPERATION() SPI_CR_1 = SPIEN               // workaround for GCC problem (it otherwise puts this command at the start of the INITIALISE_SPI_SD_INTERFACE() sequence)
        #define SET_SD_CARD_MODE()

        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED()  SPI_CSR0_1 = (SPI_CPOL | SPI_8_BITS | (((MASTER_CLOCK + 6000000/2)/6000000) << 8));

        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)    SPI_TDR_1 = (unsigned char)byte; SPI_RDR_1 = _fnSimSD_write((unsigned char)SPI_TDR_1)
            #define WAIT_TRANSMISSON_END() while (!(SPI_SR_1 & SPI_RDRF)) {SPI_SR_1 |= SPI_RDRF;}
        #else
            #define WRITE_SPI_CMD(byte)    SPI_TDR_1 = (unsigned char)byte
            #define WAIT_TRANSMISSON_END() while (!(SPI_SR_1 & SPI_RDRF)) {}
        #endif
        #define READ_SPI_DATA()        (unsigned char)SPI_RDR_1

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()  _SETBITS(1, SPI_CS1_0)              // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()      _CLEARBITS(1, SPI_CS1_0)            // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()     _SETBITS(1, SPI_CS1_0)              // negate the CS line of the SD card to be read
        #define GET_SDCARD_WP_STATE() 0                                  // write protection disabled (change to read switch if required)
    #else                                                                // EVK1105
        // Configure to suit SD card SPI mode at between 100k and 400k
        //
        #define SPI_CS1_0                  PA08
        #define SPI_CARD_DETECT            PA02
        #define SPI_WRITE_PROTECT_INPUT    PA18
        #define INITIALISE_SPI_SD_INTERFACE() \
            POWER_UP(PBA, PBAMASK_SPI0); \
            _CONFIG_PORT_INPUT(0, (SPI_WRITE_PROTECT_INPUT | SPI_CARD_DETECT)); \
            _CONFIG_DRIVE_PORT_OUTPUT_VALUE(0, SPI_CS1_0, SPI_CS1_0); \
            _CONFIG_PERIPHERAL_A(0, (SPI0_MISO_A | SPI0_MOSI_A | SPI0_SCK_A)); \
            SPI_MR_0 = (SPI_MSTR | MODFDIS | SPI_CS_0); \
            SPI_CSR0_0 = (SPI_CPOL | SPI_8_BITS | (((MASTER_CLOCK + 300000/2)/300000) << 8));
          //SPI_CR_1 = SPIEN

        #define ENABLE_SPI_SD_OPERATION() SPI_CR_0 = SPIEN               // workaround for GCC problem (it otherwise puts this command at the start of the INITIALISE_SPI_SD_INTERFACE() sequence)
        #define SET_SD_CARD_MODE()

        // Set maximum speed
        //
        #define SET_SPI_SD_INTERFACE_FULL_SPEED()  SPI_CSR0_0 = (SPI_CPOL | SPI_8_BITS | (((MASTER_CLOCK + 6000000/2)/6000000) << 8));

        #ifdef _WINDOWS
            #define WRITE_SPI_CMD(byte)    SPI_TDR_0 = (unsigned char)byte; SPI_RDR_0 = _fnSimSD_write((unsigned char)SPI_TDR_0)
            #define WAIT_TRANSMISSON_END() while (!(SPI_SR_0 & SPI_RDRF)) {SPI_SR_0 |= SPI_RDRF;};
        #else
            #define WRITE_SPI_CMD(byte)    SPI_TDR_0 = (unsigned char)byte
            #define WAIT_TRANSMISSON_END() while (!(SPI_SR_0 & SPI_RDRF)) {};
        #endif
        #define READ_SPI_DATA()        (unsigned char)SPI_RDR_0

        #define POWER_UP_SD_CARD()                                       // apply power to the SD card if appropriate
        #define POWER_DOWN_SD_CARD()                                     // remove power from SD card interface
        #define SET_SD_DI_CS_HIGH()  _SETBITS(0, SPI_CS1_0)              // force DI and CS lines high ready for the initialisation sequence
        #define SET_SD_CS_LOW()      _CLEARBITS(0, SPI_CS1_0)            // assert the CS line of the SD card to be read
        #define SET_SD_CS_HIGH()     _SETBITS(0, SPI_CS1_0)              // negate the CS line of the SD card to be read
        #define GET_SDCARD_WP_STATE() (!(_READ_PORT_MASK(0, SPI_WRITE_PROTECT_INPUT))) // write protection input

        #define SDCARD_DETECTION()   _READ_PORT_MASK(0, SPI_CARD_DETECT) // card detection input

        #define SDCARD_DETECT_PORT   PORT_0                              // card detection input defines when using interrupts
        #define SDCARD_DETECT_PIN    SPI_CARD_DETECT
    #endif
#endif


#define TICK_INTERRUPT()                                                 // {6} dummy user tick handler

#ifdef MONITOR_PERFORMANCE                                               // {15} RTC is used to monitor task durations (clocked from 115k RC oscillator without pre-scale)
    #define INITIALISE_MONITOR_TIMER() POWER_UP(PBA, PBAMASK_RM_RTC_EIC); RTC_CTRL = (RTC_CTRL_CLKEN); while (RTC_CTRL & RTC_CTRL_BUSY) {} RTC_TOP = 0xffffffff; while (RTC_CTRL & RTC_CTRL_BUSY) {} RTC_CTRL = (RTC_CTRL_CLKEN | RTC_CTRL_EN);
    #define EXECUTION_DURATION()    RTC_VAL; RTC_VAL = 0                 // read the elapsed count value and reset the counter back to 0 (the busy bit is not checked since it would only be busy when trying to reset very quickly where the value would be 0 anyway)
#endif

//#define SUPPORT_RTC                                                    // enable RTC support

// Parameter system
//
#ifdef USE_PARAMETER_BLOCK
    #define PARAMETER_BLOCK_SIZE   (8 * FLASH_GRANULARITY)               // use 4K parameter block (made up of 8 pages)
    #ifdef USE_PAR_SWAP_BLOCK                                            // swap block uses two blocks to ensure updates with no possible data los
        #define PAR_BLOCK_SIZE     (2 * PARAMETER_BLOCK_SIZE)
    #else
        #define PAR_BLOCK_SIZE     (1 * PARAMETER_BLOCK_SIZE)
    #endif
#else
    #define PAR_BLOCK_SIZE  (0)
#endif

// FLASH based File System setup
//
#ifdef FLASH_FILE_SYSTEM
    #ifdef SPI_FILE_SYSTEM
        #define PARAMETER_BLOCK_START (FLASH_START_ADDRESS + (SIZE_OF_FLASH - PAR_BLOCK_SIZE)) // FLASH location just short of end of internal FLASH
        #define uFILE_START (FLASH_START_ADDRESS + SIZE_OF_FLASH)        // immediately after internal FLASH

