sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
        #if SPI_DATA_FLASH_SIZE < (64 * FILE_GRANULARITY)                // allow testing smallest SPI FLASH
            #define FILE_SYSTEM_SIZE  SPI_DATA_FLASH_SIZE
        #else
            #define FILE_SYSTEM_SIZE (128 * FILE_GRANULARITY)            // 2 Meg reserved for file system
        #endif
        #define SPI_FLASH_START    (FLASH_START_ADDRESS + SIZE_OF_FLASH) // SPI FLASH starts immediately after FLASH
    #else
        #if !defined _AT32UC3B && !defined _AT32UC3C
            #define FLASH_ERRATA_WORKAROUND                              // AT32UC3A parts before revision J require this workaround to avoid potential Flash write problems
        #endif
        #define _FILE_SYSTEM_START_OFFSET  (160 * 1024)
        #define PARAMETER_BLOCK_START (FLASH_START_ADDRESS + _FILE_SYSTEM_START_OFFSET) // FLASH location at 160k start
        #define uFILE_START (PARAMETER_BLOCK_START + PAR_BLOCK_SIZE)     // FLASH location at 168k start (swap block assumed)
        #define FILE_GRANULARITY (8 * FLASH_GRANULARITY)                 // each file a multiple of 4k
        #ifdef FLASH_ERRATA_WORKAROUND
            #define FILE_SYSTEM_SIZE ((SIZE_OF_FLASH - FILE_GRANULARITY) - (_FILE_SYSTEM_START_OFFSET + PAR_BLOCK_SIZE)) // 340k for 512k part
          //#define FILE_SYSTEM_SIZE (92 * FILE_GRANULARITY)             // 370k reserved for file system
        #else
            #define FILE_SYSTEM_SIZE (SIZE_OF_FLASH - (_FILE_SYSTEM_START_OFFSET + PAR_BLOCK_SIZE)) // 344k for 512k part
          //#define FILE_SYSTEM_SIZE (93 * FILE_GRANULARITY)             // 374k reserved for file system
        #endif
        #define FLASH_LOW_BLOCK_ZERO  (PARAMETER_BLOCK_START - FLASH_GRANULARITY) // for FLASH workaround - one FLASH page in the first half of the FLASH
        #define FLASH_HIGH_BLOCK_ZERO ((FLASH_START_ADDRESS + SIZE_OF_FLASH) - FLASH_GRANULARITY)
    #endif
#else
    #define PARAMETER_BLOCK_START (FLASH_START_ADDRESS + 0x3fc00)
#endif


// USB interface
//
#define USB_DOWNLOAD_FILE              "z"

#define ENABLE_DPLUS_PULLUP()
#define ENABLE_DMINUS_PULLDOWN()

#define SET_USB_SYMBOL()                                                 // dummy - can be use to indicate when USB is active
#define DEL_USB_SYMBOL()                                                 // dummy - can be use to indicate when USB has been deactivated


// Serial interfaces
//
#ifdef SERIAL_INTERFACE
    #define WELCOME_MESSAGE_UART   "\r\n\nHello, world... AVR32\r\n"
    #define NUMBER_EXTERNAL_SERIAL 0                                     // {5}
    #ifdef _AT32UC3B                                                     // {7}
        #ifdef CHIP_48_PIN
            #define NUMBER_SERIAL  2                                     // maximum 2 USARTs
        #else
            #define NUMBER_SERIAL  3                                     // maximum 3 USARTs
        #endif
    #elif defined AVR32_AT32UC3C_EK
        #define NUMBER_SERIAL      5                                     // maximum 5 USARTs
    #else
        #define NUMBER_SERIAL      4                                     // maximum 4 USARTs
    #endif
    #define UARTS_AVAILABLE        NUMBER_SERIAL
    #define SIM_COM_EXTENDED                                             // COM ports defined from 1..255
    #define SERIAL_PORT_0          7                                     // if we open UART channel 0 we simulate using this COM port on the PC
    #define SERIAL_PORT_1          9                                     // if we open UART channel 1 we simulate using this COM port on the PC
    #define SERIAL_PORT_2          9                                     // if we open UART channel 2 we simulate using this COM port on the PC
    #define SERIAL_PORT_3          9                                     // if we open UART channel 3 we simulate using this COM port on the PC
    #define SERIAL_PORT_4          9                                     // if we open UART channel 4 we simulate using this COM port on the PC

  //#define SERIAL_SUPPORT_DMA                                           // enable UART DMA support (available on this processor)
  //#define SUPPORT_HW_FLOW                                              // enable hardware flow control support

    #if defined AVR32_EVK1101
        #define DEMO_UART          1                                     // use UART - 1 connected to DSUB on EVK1101
    #elif defined AVR32_AT32UC3C_EK
        #define DEMO_UART          2                                     // use UART - 2 connected to USB on AT32UC3_EK
    #elif defined AVR32_UC3_C2_XPLAINED                                  // {16}
        #define DEMO_UART          3                                     // use UART - 3
    #else
        #define DEMO_UART          0                                     // use UART - 0 connected to USB on EVK1105
    #endif
    #define MODBUS_UART_0          0
    #define MODBUS_UART_1          2
    #define MODBUS_UART_2          3
    #define MODBUS_UART_3          0
    #define PPP_UART               1                                     // use UART 1 for PPP
    #define TX_BUFFER_SIZE         (4 * 1024)                            // the size of RS232 input and output buffers
    #define RX_BUFFER_SIZE         (64)

    #if defined _AT32UC3B
        #ifndef CHIP_48_PIN                                              // alternative USART pins only possible on 64 pin device
          //#define USART0_ON_1
          //#define USART2_ON_PINS_26_27
          //#define USART1_RTS_ON_1
          //#define USART1_CTS_ON_1
        #endif
    #elif defined _AT32UC3C
          //#define USART0_ON_3_1
          //#define USART0_ON_2
          //#define USART1_ON_3
          //#define USART2_ON_PC2_3
        #if defined AVR32_UC3_C2_XPLAINED                                // {16}
            #define USART3_ON_2
        #else
          //#define USART3_ON_2
        #endif
          //#define USART3_ON_3_1
          //#define USART4_ON_3
          //#define USART4_ON_2_1
    #else
        #ifdef CHIP_144_PIN                                              // alternative USART TX + RX pins - these are only possible with 144 pin parts
          //#define USART0_ON_3                                          // else on 1
          //#define USART1_ON_3                                          // else on 1
          //#define USART2_ON_3                                          // else on 1
          //#define USART3_ON_2                                          // else on 1

          //#define USART0_RTS_ON_3                                      // alternate USART RT/CTS pins
          //#define USART1_RTS_ON_2
          //#define USART2_RTS_ON_3
          //#define USART3_RTS_ON_2
          //#define USART0_CTS_ON_3
          //#define USART1_CTS_ON_3
          //#define USART2_CTS_ON_3
          //#define USART3_CTS_ON_2
        #endif
    #endif
  //#define USART2_RTS_ON_1                                              // alternate USART RT/CTS pins available on all devices
  //#define USART2_CTS_ON_1
#else
    #define TX_BUFFER_SIZE       (256)
    #define RX_BUFFER_SIZE       (256)
#endif

//#define SUPPORT_TIMER                                                  // support hardware timer interrupt configuration
#if defined MODBUS_RTU && !defined SUPPORT_TIMER
    #define SUPPORT_TIMER                                                // MODBUS required HW timer in RTU mode

  //#define TIMER_A0_PX                                                  // otherwise on port B
  //#define TIMER_B0_PX                                                  // otherwise on port B
  //#define TIMER_A1_PX                                                  // otherwise on port B
  //#define TIMER_B1_PX                                                  // otherwise on port B
  //#define TIMER_A2_PX                                                  // otherwise on port B
  //#define TIMER_B2_PX                                                  // otherwise on port B
#endif
#if defined MODBUS_RTU
    #define SUPPORT_US_TIMER                                             // activate us mode
#endif

#define _TIMER_INTERRUPT_SETUP  TIMER_INTERRUPT_SETUP
#define MODBUS0_TIMER_CHANNEL    0
#define MODBUS1_TIMER_CHANNEL    1
#define MODBUS2_TIMER_CHANNEL    2

// I2C Interface
//
#if defined I2C_INTERFACE
    #define OUR_I2C_CHANNEL  0                                           // AVR32 has only one I2C (TWI) interface
#endif

//#define SUPPORT_EXTERNAL_INTERRUPTS                                    // support handling external interrupts
#define SUPPORT_PORT_INTERRUPTS                                          // support handling port interrupts
#if defined SUPPORT_PORT_INTERRUPTS
    #define SUPPORT_PORT_0_INTERRUPTS                                    // support just defined ports if required
    #if !defined _AT32UC3B || !defined CHIP_48_PIN
        #define SUPPORT_PORT_1_INTERRUPTS
    #endif
    #ifndef _AT32UC3B
        #define SUPPORT_PORT_2_INTERRUPTS
        #define SUPPORT_PORT_3_INTERRUPTS
    #endif
#endif

//#define SUPPORT_ADC                                                    // enable ADC support
#define ADC_AUTO_TRIGGERS                                                // support automatic triggering mode of operation
#define ADC_REFERENCE_VOLTAGE                      3300                  // ADC uses 3.3V reference
#define ADC_SIM_STEP_SIZE                          (200 * ADC_FULL_SCALE_10BIT) // 200mV steps when simulating

#if defined SUPPORT_ADC
    #define AN0_START_VOLTAGE                      (33   * ADC_FULL_SCALE_10BIT) // initial voltages when simulating (mV)
    #define AN1_START_VOLTAGE                      (500  * ADC_FULL_SCALE_10BIT)
    #define AN2_START_VOLTAGE                      (1000 * ADC_FULL_SCALE_10BIT)
    #define AN3_START_VOLTAGE                      (1500 * ADC_FULL_SCALE_10BIT)
    #define AN4_START_VOLTAGE                      (2000 * ADC_FULL_SCALE_10BIT)
    #define AN5_START_VOLTAGE                      (2500 * ADC_FULL_SCALE_10BIT)
    #define AN6_START_VOLTAGE                      (3000 * ADC_FULL_SCALE_10BIT)
    #define AN7_START_VOLTAGE                      (3300 * ADC_FULL_SCALE_10BIT)

