sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
    #define ADC_ERR_PRIORITY                       0
#endif


// LAN interface
//
#if defined ETH_INTERFACE
  //#define LAN_REPORT_ACTIVITY                                          // transmissions/receptions and errors are reported to chosen task (for link LED control, etc)

    #if defined LAN_REPORT_ACTIVITY
        #define LNKLED                 PB30
        #define ACTLED                 PB29
        #define SPDLED                 PB28
        #define DUPLED                 PB27
        #define COLLED                 PB24
        #define ACTIVITY_LED_OFF()     _CLEARBITS(1, ACTLED)
        #define ACTIVITY_LED_ON()      _SETBITS(1, ACTLED)
        #define TURN_LINK_LED_ON()     _SETBITS(1, LNKLED)
        #define SPEED_LED_ON()         _SETBITS(1, (SPDLED | LNKLED))
        #define SPEED_LED_OFF()        _CLEARBITS(1, (SPDLED | LNKLED))
        #define LINK_DOWN_LEDS()       _CLEARBITS(1, (LNKLED | ACTLED | COLLED | SPDLED | DUPLED))

        #define CONFIGURE_LAN_LEDS()   _CONFIG_PORT_OUTPUT(1, (LNKLED | ACTLED | COLLED | SPDLED | DUPLED)); LINK_DOWN_LEDS()
    #endif

    #define NUMBER_OF_TX_BUFFERS_IN_ETHERNET_DEVICE 1
    #define NUMBER_OF_RX_BUFFERS_IN_ETHERNET_DEVICE 4
#endif

#ifdef USE_IP
    #define LAN_BUFFER_SIZE           1536                               // AVR32 has ample space for full tx buffer
#else
    #define LAN_BUFFER_SIZE           256                                // if using Ethernet without IP the buffer size can be set here
#endif


#ifdef USE_BUFFERED_TCP                                                  // if using a buffer for TCP to allow interractive data applications (like TELNET)
    #define TCP_BUFFER            2800                                   // size of TCP buffer (with USE_BUFFERED_TCP) - generous with AVR32
    #define TCP_BUFFER_FRAME      1400                                   // allow this max. TCP frame size
#endif

#ifdef USE_HTTP
    #define HTTP_BUFFER_LENGTH    1400                                   // we send frames with this maximum amount of payload data - generous with AVR32
#endif

#ifdef USE_FTP                                                           // specify FTP support details
    #define FTP_WELCOME_RESPONSE         "220 Welcome AVR32 FTP.\r\n"
    //                                        ^^^^^^^^^^^^^^^^^^            customise the FTP welcome here
#endif


// Define interrupt priorities in the system (levels 0..3 - lowest to highest)
//
#define PRIORITY_USBB              INT_LEVEL_3                           // {10}
#define PRIORITY_DMA               INT_LEVEL_2
#define PRIORITY_UART0             INT_LEVEL_2
#define PRIORITY_UART1             INT_LEVEL_2
#define PRIORITY_UART2             INT_LEVEL_2
#define PRIORITY_UART3             INT_LEVEL_2
#define PRIORITY_UART4             INT_LEVEL_2
#define PRIORITY_MACB              INT_LEVEL_2
#define PRIORITY_GPIO              INT_LEVEL_2
#define PRIORITY_TIMERS            INT_LEVEL_1
#define PRIORITY_HW_TIMER          PRIORITY_TIMERS
#define PRIORITY_TWI               INT_LEVEL_1
#define PRIORITY_TICK_TIMER        INT_LEVEL_1



// Ports
//
#define MEASURE_LOW_POWER_ON()
#define MEASURE_LOW_POWER_OFF()

#define PORT0_DEFAULT_INPUT        0xffffffff                            // default state of inputs when simulating
#if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
    #define PORT1_DEFAULT_INPUT    0xffffffff
#else
    #define PORT1_DEFAULT_INPUT    0xff7fffff                            // pull PB23 down so that the watchdog is enabled
#endif
#define PORT2_DEFAULT_INPUT        0xffffffff
#define PORT3_DEFAULT_INPUT        0xffffffff


#define CONFIG_TEST_OUTPUT()                                             // we use DEMO_LED_2 which is configured by the user code (and can be disabled in parameters if required)
#define TOGGLE_TEST_OUTPUT()       _TOGGLE_PORT(1, TEST_OUTPUT_LED)


#define WATCHDOG_TIMEOUT           (17 << WATCHDOG_PRE_SHIFT)            // watchdog fires after 2.2s without retrigger (2 to the power of (17 + 1) / 115000 [slow clock])


// User port mapping
//
#if defined AVR32_EVK1101                                                // {7}
    #define USER_PORT_1_BIT        PA09                                  // use free PA pins on Eval board
    #define USER_PORT_2_BIT        PA10
    #define USER_PORT_3_BIT        PA11
    #define USER_PORT_4_BIT        PA12
    #define USER_PORT_5_BIT        PA13
    #define USER_PORT_6_BIT        PA14
    #define USER_PORT_7_BIT        PA15
    #define USER_PORT_8_BIT        0 //PA16
    #define USER_PORT_9_BIT        PA17
    #define USER_PORT_10_BIT       PA25
    #define USER_PORT_11_BIT       PA26
    #define USER_PORT_12_BIT       PA27
    #define USER_PORT_13_BIT       PA28
    #define USER_PORT_14_BIT       PA29
    #define USER_PORT_15_BIT       PA30
    #define USER_PORT_16_BIT       PA31
#elif defined AVR32_AT32UC3C_EK                                          // {13}
    #define USER_PORT_1_BIT        PA12                                  // use free PA pins on Eval board
    #define USER_PORT_2_BIT        PA13
    #define USER_PORT_3_BIT        PA13                                  // keep PA14 and PA29 free
    #define USER_PORT_4_BIT        PA15
    #define USER_PORT_5_BIT        PA16
    #define USER_PORT_6_BIT        PA19
    #define USER_PORT_7_BIT        PA20
    #define USER_PORT_8_BIT        PA21
    #define USER_PORT_9_BIT        PA22
    #define USER_PORT_10_BIT       PA23
    #define USER_PORT_11_BIT       PA24
    #define USER_PORT_12_BIT       PA25
    #define USER_PORT_13_BIT       PA26
    #define USER_PORT_14_BIT       PA27
    #define USER_PORT_15_BIT       PA28
    #define USER_PORT_16_BIT       PA28
#elif defined AVR32_UC3_C2_XPLAINED                                      // {16}
    #define USER_PORT_1_BIT        0
    #define USER_PORT_2_BIT        0
    #define USER_PORT_3_BIT        0
    #define USER_PORT_4_BIT        0
    #define USER_PORT_5_BIT        0
    #define USER_PORT_6_BIT        0
    #define USER_PORT_7_BIT        0
    #define USER_PORT_8_BIT        0
    #define USER_PORT_9_BIT        0
    #define USER_PORT_10_BIT       0
    #define USER_PORT_11_BIT       0
    #define USER_PORT_12_BIT       0
    #define USER_PORT_13_BIT       0
    #define USER_PORT_14_BIT       0
    #define USER_PORT_15_BIT       0
    #define USER_PORT_16_BIT       0
#else
    #define USER_PORT_1_BIT        PA05                                  // use free PA pins on Eval board
    #define USER_PORT_2_BIT        PA06
    #define USER_PORT_3_BIT        PA02
    #define USER_PORT_4_BIT        PA03
    #define USER_PORT_5_BIT        PA04
    #define USER_PORT_6_BIT        PA07
    #define USER_PORT_7_BIT        PA08
    #define USER_PORT_8_BIT        PA09
    #define USER_PORT_9_BIT        0 //PA10
    #define USER_PORT_10_BIT       PA11
    #define USER_PORT_11_BIT       PA12
    #define USER_PORT_12_BIT       PA13
    #define USER_PORT_13_BIT       PA14
    #define USER_PORT_14_BIT       PA15
    #define USER_PORT_15_BIT       PA16
    #define USER_PORT_16_BIT       PA17
#endif
// Port use definitions
//
#define USER_SET_PORT_1            OVRS_0
#define USER_CLEAR_PORT_1          OVRC_0
#define USER_PORT_1                OVR_0
#define USER_DDR_1                 ODERS_0
#define USER_SET_PORT_2            OVRS_0
#define USER_CLEAR_PORT_2          OVRC_0
#define USER_PORT_2                OVR_0
#define USER_DDR_2                 ODERS_0
#define USER_SET_PORT_3            OVRS_0
#define USER_CLEAR_PORT_3          OVRC_0
#define USER_PORT_3                OVR_0
#define USER_DDR_3                 ODERS_0
#define USER_SET_PORT_4            OVRS_0
#define USER_CLEAR_PORT_4          OVRC_0
#define USER_PORT_4                OVR_0
#define USER_DDR_4                 ODERS_0
#define USER_SET_PORT_5            OVRS_0
#define USER_CLEAR_PORT_5          OVRC_0
#define USER_PORT_5                OVR_0
#define USER_DDR_5                 ODERS_0
#define USER_SET_PORT_6            OVRS_0
#define USER_CLEAR_PORT_6          OVRC_0
#define USER_PORT_6                OVR_0
#define USER_DDR_6                 ODERS_0
#define USER_SET_PORT_7            OVRS_0
#define USER_CLEAR_PORT_7          OVRC_0
#define USER_PORT_7                OVR_0
#define USER_DDR_7                 ODERS_0
#define USER_SET_PORT_8            OVRS_0
#define USER_CLEAR_PORT_8          OVRC_0
#define USER_PORT_8                OVR_0
#define USER_DDR_8                 ODERS_0
#define USER_SET_PORT_9            OVRS_0
#define USER_CLEAR_PORT_9          OVRC_0
#define USER_PORT_9                OVR_0
#define USER_DDR_9                 ODERS_0
#define USER_SET_PORT_10           OVRS_0
#define USER_CLEAR_PORT_10         OVRC_0
#define USER_PORT_10               OVR_0
#define USER_DDR_10                ODERS_0
#define USER_SET_PORT_11           OVRS_0
#define USER_CLEAR_PORT_11         OVRC_0
#define USER_PORT_11               OVR_0
#define USER_DDR_11                ODERS_0
#define USER_SET_PORT_12           OVRS_0
#define USER_CLEAR_PORT_12         OVRC_0
#define USER_PORT_12               OVR_0
#define USER_DDR_12                ODERS_0
#define USER_SET_PORT_13           OVRS_0
#define USER_CLEAR_PORT_13         OVRC_0
#define USER_PORT_13               OVR_0
#define USER_DDR_13                ODERS_0
#define USER_SET_PORT_14           OVRS_0
#define USER_CLEAR_PORT_14         OVRC_0
#define USER_PORT_14               OVR_0
#define USER_DDR_14                ODERS_0
#define USER_SET_PORT_15           OVRS_0
#define USER_CLEAR_PORT_15         OVRC_0
#define USER_PORT_15               OVR_0
#define USER_DDR_15                ODERS_0
#define USER_SET_PORT_16           OVRS_0
#define USER_CLEAR_PORT_16         OVRC_0
#define USER_PORT_16               OVR_0
#define USER_DDR_16                ODERS_0



// Evaluation board settings for ports and PHY interface
//
#if defined AVR32_EVK1100                                                // {1}
    #define SHIFT_PORT_TO_BYTE      27
    #define FIRST_USER_PORT         PB27
    #define DEMO_LED_1              (PB27 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_LED_2              (PB28 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_LED_3              (PB29 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_LED_4              (PB30 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_USER_PORTS         (PB27 | PB28 | PB29 | PB30)
    #define TEST_OUTPUT_LED         PB28
    #define BLINK_LED               PB27

    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(1, BLINK_LED);
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(1, BLINK_LED)        // blink the LED, if set as output
    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(1, PB23)       // ensure clocks to port
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(1, PB23))        // pull this input up to disable watchdog - hold DOWN KEY on EVK1105

