sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
    #define PHY_RMII                                                     // PHY MII interface is connected as reduced MII

    #define _PHY_DP83848
    #define PHY_ADDRESS_  0x01                                           // address of PHY on EVK1105 (RMII mode)
    #define VNDR_MDL      0x09                                           // Vendor model number
    #define MDL_REV       0x00                                           // Model revision number
    #define PHY_IDENTIFIER          (0x20005c00 | (VNDR_MDL << 4) | MDL_REV) // NATIONAL DP83848 identifier
    #define PHY_MASK                0xfffffff0
    #define PHY_INTERRUPT           PA24
    #define PORT_PHY_INT            PORT_0
    #define PHY_INPUT_LOW()         (!(PVR_0 & PHY_INTERRUPT))
    #define PHY_POWERUP_DELAY      (0.150 * SEC)                         // plus 50ms task delay to give > 167ms - the time required for the PHY to stabilise after a power up

    // SMTP settings
    //
    #define SENDERS_EMAIL_ADDRESS             "EVK1105@uTasker.com"      // fictional Email address of the board being used
    #define EMAIL_SUBJECT                     "EVK1105 Test"             // Email subject
    #define EMAIL_CONTENT                     "Hello!!\r\nThis is an email message from the AVR32 AT32UC3A on the EVK1105.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your EVK1105!!";
#elif defined AVR32_EVK1101                                              // {7}
    #define SWITCH_PB0              PB02
    #define SWITCH_PB1              PB03

    #define JOY_STICK_CTR           PA13
    #define JOY_STICK_A             PB06
    #define JOY_STICK_B             PB07
    #define JOY_STICK_C             PB08
    #define JOY_STICK_D             PB09
    #define SHIFT_PORT_TO_BYTE      7
    #define FIRST_USER_PORT         PA07
    #define DEMO_LED_1              (PA07 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_LED_2              (PA08 >> SHIFT_PORT_TO_BYTE)
//  #define DEMO_LED_3              (PB29 >> SHIFT_PORT_TO_BYTE)
//  #define DEMO_LED_4              (PB30 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_USER_PORTS         (PA07 | PA08)
    #define TEST_OUTPUT_LED         PA08
    #define BLINK_LED               PA07

    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(0, BLINK_LED);
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(0, BLINK_LED)        // blink the LED, if set as output
    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(1, PB02)       // ensure clocks to port and configure as input
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(1, PB02))        // pull this input up to disable watchdog - hold PB0 on EVK1101
#elif defined AVR32_EVK1105
    #define TOUCH_DETECT            PA22
    #define TOUCH_LEFT              PB25
    #define TOUCH_RIGHT             PB24
    #define TOUCH_UP                PB22
    #define TOUCH_DOWN              PB23
    #define TOUCH_ENTER             PB26

    #define SHIFT_PORT_TO_BYTE      27
    #define FIRST_USER_PORT         PB27
    #define DEMO_LED_1              (PB27 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_LED_2              (PB28 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_LED_3              (PB29 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_LED_4              (PB30 >> SHIFT_PORT_TO_BYTE)
    #define DEMO_USER_PORTS         (PB27 | PB28 | PB29 | PB30)
    #define TEST_OUTPUT_LED         PB28
    #define BLINK_LED               PB27

    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(1, BLINK_LED);
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(1, BLINK_LED)        // blink the LED, if set as output
    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(1, PB23)       // ensure clocks to port
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(1, PB23))        // pull this input up to disable watchdog - hold DOWN KEY on EVK1105

    #define PHY_RMII                                                     // PHY MII interface is connected as reduced MII

    #define _PHY_DP83848
    #define PHY_ADDRESS_  0x01                                           // address of PHY on EVK1105 (RMII mode)
    #define VNDR_MDL      0x09                                           // vendor model number
    #define MDL_REV       0x00                                           // model revision number
    #define PHY_IDENTIFIER          (0x20005c00 | (VNDR_MDL << 4) | MDL_REV) // NATIONAL DP83848 identifier
    #define PHY_MASK                0xfffffff0
    #define PHY_INTERRUPT           PA26
    #define PORT_PHY_INT            PORT_0
    #define PHY_INPUT_LOW()         (!(PVR_0 & PHY_INTERRUPT))
    #define PHY_POWERUP_DELAY       (0.150 * SEC)                        // plus 50ms task delay to give > 167ms - the time required for the PHY to stabilise after a power up

    // SMTP settings
    //
    #define SENDERS_EMAIL_ADDRESS             "EVK1105@uTasker.com"      // fictional Email address of the board being used
    #define EMAIL_SUBJECT                     "EVK1105 Test"             // Email subject
    #define EMAIL_CONTENT                     "Hello!!\r\nThis is an email message from the AVR32 AT32UC3A on the EVK1105.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your EVK1105!!";
#elif defined AVR32_AT32UC3C_EK                                          // {13}
    #define SWITCH_PB0              (PA14)
    #define SWITCH_PB1              (PA29)
    #define DEMO_LED_1              (PA08)
    #define DEMO_LED_2              (PC13)
    #define DEMO_LED_3              (PD22)
    #define DEMO_LED_4              (PD23)
    #define TEST_OUTPUT_LED         DEMO_LED_4
    #define BLINK_LED               DEMO_LED_1

    #define SHIFT_DEMO_LED_1        8                                    // since the port bits are spread out shift each to the lowest 4 bits
    #define SHIFT_DEMO_LED_2        13
    #define SHIFT_DEMO_LED_3        22
    #define SHIFT_DEMO_LED_4        23

    #define MAPPED_DEMO_LED_1       (DEMO_LED_1 >> SHIFT_DEMO_LED_1)
    #define MAPPED_DEMO_LED_2       (DEMO_LED_2 >> SHIFT_DEMO_LED_2)
    #define MAPPED_DEMO_LED_3       (DEMO_LED_3 >> SHIFT_DEMO_LED_3)
    #define MAPPED_DEMO_LED_4       (DEMO_LED_4 >> SHIFT_DEMO_LED_4)

    #define INIT_WATCHDOG_LED()        _CONFIG_PORT_OUTPUT(0, BLINK_LED);
    #define TOGGLE_WATCHDOG_LED()      _TOGGLE_PORT(0, BLINK_LED)        // blink the LED, if set as output
    #define INIT_WATCHDOG_DISABLE()    _CONFIG_PORT_INPUT(0, SWITCH_PB0) // ensure clocks to port
    #define WATCHDOG_DISABLE()         (_READ_PORT_MASK(0, SWITCH_PB0))  // pull this input up to disable watchdog - hold PB0 on AT32C3C-EK

