sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
    #define PHY_RMII                                                     // PHY MII interface is connected as reduced MII

    #define _PHY_DP83848
    #define PHY_ADDRESS_  0x01                                           // address of PHY on EVK1105 (RMII mode)
    #define VNDR_MDL      0x09                                           // vendor model number
    #define MDL_REV       0x00                                           // model revision number
    #define PHY_IDENTIFIER          (0x20005c00 | (VNDR_MDL << 4) | MDL_REV) // NATIONAL DP83848 identifier
    #define PHY_MASK                0xfffffff0
    #define PHY_INTERRUPT           PB31
    #define PORT_PHY_INT            PORT_1
    #define PHY_INPUT_LOW()         (!(PVR_1 & PHY_INTERRUPT))
    #define PHY_POWERUP_DELAY      (0.150 * SEC)                         // plus 50ms task delay to give > 167ms - the time required for the PHY to stabilise after a power up

    // SMTP settings
    //
    #define SENDERS_EMAIL_ADDRESS   "AT32UC3_EK@uTasker.com"             // fictional Email address of the board being used
    #define EMAIL_SUBJECT           "AT32UC3_EK Test"                    // email subject
    #define EMAIL_CONTENT           "Hello!!\r\nThis is an email message from the AVR32 AT32UC3C on the AC32UC3_EK.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your AC32UC3_EK!!";
#elif defined AVR32_UC3_C2_XPLAINED                                      // {16}
    #define ADCIN0                  (PA09)
    #define PHYRSTB                 ADCIN0                               // connected when J100 is not broken

    #define BUTTON0                 (PC15)
    #define BUTTON1                 (PA23)
    #define DEMO_LED_1              (PD21)
    #define DEMO_LED_2              (PC22)
    #define TEST_OUTPUT_LED         0
    #define BLINK_LED               DEMO_LED_1

    #define SHIFT_DEMO_LED_1        21                                    // since the port bits are spread out shift each to the lowest 2 bits
    #define SHIFT_DEMO_LED_2        21

    #define MAPPED_DEMO_LED_1       (DEMO_LED_1 >> SHIFT_DEMO_LED_1)
    #define MAPPED_DEMO_LED_2       (DEMO_LED_2 >> SHIFT_DEMO_LED_2)

    #if defined USE_MAINTENANCE
        #define INIT_WATCHDOG_LED() 
    #else
        #define INIT_WATCHDOG_LED() _CONFIG_PORT_OUTPUT(3, BLINK_LED);
    #endif
    #define TOGGLE_WATCHDOG_LED()   _TOGGLE_PORT(3, BLINK_LED)           // blink the LED, if set as output
    #define INIT_WATCHDOG_DISABLE() _CONFIG_PORT_INPUT(3, DEMO_LED_1)
    #define WATCHDOG_DISABLE()      (_READ_PORT_MASK(3, DEMO_LED_1))     // pull this input up to disable watchdog - hold PB0 on UC3-C2 X plained

    #define PHY_RMII                                                     // PHY MII interface is connected as reduced MII

    #define _PHY_RTL8201E
    #define PHY_ADDRESS_            0x01                                 // address of PHY on UC3-C2 X plained (RMII mode)
    #define VNDR_MDL                0x01                                 // vendor model number
    #define MDL_REV                 0x05                                 // model revision number
    #define PHY_IDENTIFIER          (0x001cc800 | (VNDR_MDL << 4) | MDL_REV) // realtek RTL8201E identifier
    #define PHY_MASK                0xfffffff0
    #define PHY_POLL_LINK                                                // since there is no interrupt line we poll the link state to ensure that the configuration is synchronised in the EMAC
    #define INTERRUPT_TASK_PHY      TASK_NETWORK_INDICATOR               // link status reported to this task
  //#define PHY_INTERRUPT           0                                    // no interrupt line connected
  //#define PORT_PHY_INT            PORT_1
  //#define PHY_INPUT_LOW()         (!(PVR_1 & PHY_INTERRUPT))
    #define PHY_POWERUP_DELAY       (0.250 * SEC)                        // plus 250ms task delay to give 300ms - to allow the PHY to become ready after reset

    #define RESET_PHY                                                    // enable reset control
    #define ASSERT_PHY_RST()        _CONFIG_DRIVE_PORT_OUTPUT_VALUE(0, PHYRSTB, 0); fnDelayLoop(12000); _SETBITS(0, PHYRSTB);// assert PHY reset for 12ms
    #define CONFIG_PHY_STRAPS()                                          // the module configures straps itself
    #define DEASSERT_PHY_RST()                                           // release PHY from reset state (not used since it is integrated in the reset pulse on initialisation

    // SMTP settings
    //
    #define SENDERS_EMAIL_ADDRESS   "UC3-C2@uTasker.com"                 // fictional Email address of the board being used
    #define EMAIL_SUBJECT           "UC3-C2 X plained Test"              // email subject
    #define EMAIL_CONTENT           "Hello!!\r\nThis is an email message from the AVR32 AT32UC3C on the UC3-C2 X plained.\r\nI hope that you have received this test and have fun using the uTasker operating system with integrated TCP/IP stack.\r\r\nRegards your UC3-C2 X plained!!";

#endif


// LCD interface: Backlight control PB4 : Data bus (4 Bit) PB313..PB10 : RS PB14, RW PB16, E PB17
//
typedef unsigned long LCD_BUS_PORT_SIZE;                                 // we use 32 bit ports on the AVR32
typedef unsigned long LCD_CONTROL_PORT_SIZE;
//#define LCD_BUS_8BIT                                                   // data bus in 8 bit mode
#define LCD_BUS_4BIT                                                     // data bus in 4 bit mode

#ifdef LCD_BUS_8BIT
    #define LCD_BUS_MASK      0x0003fc00
    #define DATA_SHIFT_RIGHT     0
    #define DATA_SHIFT_LEFT      10                                      // byte shift down required to bring data into position
#else
    #define LCD_BUS_MASK      0x00003c00
    #define DATA_SHIFT_RIGHT     0
    #define DATA_SHIFT_LEFT      6                                       // nibble shift down required to bring data into position
#endif

