sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
#define O_CONTROL_RS            PB14
#define O_WRITE_READ            PB16
#define O_CONTROL_EN            PB17
#define O_LCD_BACKLIGHT         PB04

#define O_CONTROL_LINES           (O_CONTROL_RS | O_WRITE_READ | O_CONTROL_EN)
#define IO_BUS_PORT_DAT_IN        _READ_PORT(1)

#define SET_DATA_LINES_INPUT()    _FLOAT_PORT(1, LCD_BUS_MASK)
#define SET_DATA_LINES_OUTPUT()   _DRIVE_PORT_OUTPUT(1, LCD_BUS_MASK)
#define SET_BUS_DATA(x)           _WRITE_PORT(1, x)
#define SET_CONTROL_LINES(x)      _CLEARBITS(1, O_CONTROL_LINES); _SETBITS(1, x) // first clear mask and then set bits
#define O_SET_CONTROL_LOW(x)      _CLEARBITS(1, x)
#define O_SET_CONTROL_HIGH(x)     _SETBITS(1, x)

// Drive the control lines R/W + LCD Backlight '1', RS + E '0' and the data lines with all high impedance at start up
// enable clocks to port first
#define INITIALISE_LCD_CONTROL_LINES()   _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, (O_CONTROL_LINES | O_LCD_BACKLIGHT), (O_LCD_BACKLIGHT | O_WRITE_READ)); \
                                         _CONFIG_PORT_INPUT(1, LCD_BUS_MASK);

#define LCD_DRIVE_DATA()        _DRIVE_PORT_OUTPUT(1, LCD_BUS_MASK);_DRIVE_PORT_OUTPUT(1, LCD_BUS_MASK)
                                // ensure data bus outputs (delay) by repetitions according to processor speed

#define CLOCK_EN_HIGH()         _SETBITS(1, O_CONTROL_EN); _SETBITS(1, O_CONTROL_EN);
                                // clock EN to high state - repreat to slow down (delay)

#define DELAY_ENABLE_CLOCK_HIGH()


#if defined GLCD_COLOR || defined CGLCD_GLCD_MODE                        // {3}
    // CGLCD
    //
    #if defined AVR32_AT32UC3C_EK || defined AVR32_UC3_C2_XPLAINED
        #define GLCD_RESET_LINE        PD16
        #define GLCD_BACKLIGHT         PD28
        #define GTE_INPUT              PD19
        #define CONFIGURE_GLCD()       _CONFIG_PORT_INPUT(3, PD19); _CONFIG_DRIVE_PORT_OUTPUT_VALUE(3, (GLCD_RESET_LINE | GLCD_BACKLIGHT), 0);
        #define GLCD_RST_H()           _SETBITS(3, GLCD_RESET_LINE)
        #define ENABLE_BACKLIGHT()     _SETBITS(3, GLCD_BACKLIGHT)
    #else
        #define GLCD_RESET_LINE        PX22 
        #define GLCD_BACKLIGHT         PB18
        #define GLCD_SPI_CS            PX33
        #define GTE_INPUT              PX19
        #define CONFIGURE_GLCD()       _CONFIG_PORT_INPUT(2, PX19); _CONFIG_DRIVE_PORT_OUTPUT_VALUE(1, GLCD_BACKLIGHT, 0); _CONFIG_DRIVE_PORT_OUTPUT_VALUE(2, (GLCD_SPI_CS | GLCD_RESET_LINE), GLCD_SPI_CS);
        #define GLCD_RST_H()           _SETBITS(2, GLCD_RESET_LINE)
        #define ENABLE_BACKLIGHT()     _SETBITS(1, GLCD_BACKLIGHT)
    #endif
    #undef GLCD_X                                                        // overwrite the standard CGLCD size
    #undef GLCD_Y
      #define GLCD_X                   320                               // horizontal resolution of the LCD display in pixels
      #define GLCD_Y                   240                               // vertical resolution of the LCD display in pixels
    #undef BIG_PIXEL                                                     // large display so no need for double size pixels
    #define _HX8347                                                      // define the controller type being used
    #ifdef _WINDOWS
        #define MAX_GLCD_WRITE_BURST   1000                              // the maximum number of writes to the GLCD before the task yields
    #else
        #define MAX_GLCD_WRITE_BURST   512                               // the maximum number of writes to the GLCD before the task yields
    #endif
#else
    // GLCD
    //
    #ifndef _GLCD_SAMSUNG
        #define GLCD_RST               PX36
        #define GLCD_C_D               PX35
        #define GLCD_WR                PX14
        #define GLCD_RD                PX13
        #define CONFIGURE_GLCD()       _CONFIG_DRIVE_PORT_OUTPUT_VALUE(3, (GLCD_RST | GLCD_WR | GLCD_RD | GLCD_C_D), (GLCD_WR | GLCD_RD | GLCD_C_D)); _CONFIG_PORT_INPUT(3, 0xff);

        #define GLCD_DATAASOUTPUT()    _DRIVE_PORT_OUTPUT(3, 0xff)
        #define GLCD_DATAASINPUT()     _FLOAT_PORT(3, 0xff)

        #define GLCD_DATAOUT(data)     _WRITE_PORT_MASK(3, data, 0xff)
        #define GLCD_DATAIN()          _READ_PORT(3)

        #define SET_PULL_DOWNS()       
        #define REMOVE_PULL_DOWNS()    

        #define GLCD_WR_H()            _SETBITS(3, GLCD_WR)
        #define GLCD_WR_L()            _CLEARBITS(3, GLCD_WR)

        #define GLCD_CD_H()            _SETBITS(3, GLCD_C_D)
        #define GLCD_CD_L()            _CLEARBITS(3, GLCD_C_D)

        #define GLCD_RD_H()             _SETBITS(3, GLCD_RD)
        #define GLCD_RD_L()            _CLEARBITS(3, GLCD_RD)

        #define GLCD_DELAY_WRITE()     //GLCD_WR_L()                     // no write delay since the data is stable for long enough at full speed
        #define GLCD_DELAY_READ()      GLCD_RD_L()                       // one extra operation to ensure set up time of read

        #define GLCD_RST_H()           _SETBITS(3, GLCD_RST) 
        #define GLCD_RST_L()           _CLEARBITS(3, GLCD_RST)

        #ifdef _WINDOWS
            #define MAX_GLCD_WRITE_BURST   1000                          // the maximum number of writes to the GLCD before the task yields
        #else
            #define MAX_GLCD_WRITE_BURST   20                            // the maximum number of writes to the GLCD before the task yields
        #endif
    #else                                                                // {4}
        #define GLCD_RST               PX36                              // reset
        #define GLCD_RS                PX35                              // GLCD Register Select
        #define GLCD_RW                PX14                              // GLCD Read/Write
        #define GLCD_ENA               PX13                              // GLCD Enable

        #define GLCD_CS0               PX12                              // LCD Controller 0 Chip Select - 2 controller chips for 128 x 64
        #define GLCD_CS1               PX11                              // LCD Controller 1 Chip Select

        #define SET_PULL_DOWNS()       
        #define REMOVE_PULL_DOWNS()    

        #define CONFIGURE_GLCD() _CONFIG_DRIVE_PORT_OUTPUT_VALUE(3, (GLCD_RST | GLCD_RW | GLCD_ENA | GLCD_RS | GLCD_CS0 | GLCD_CS1), (GLCD_RW)); _CONFIG_PORT_INPUT(3, 0xff);

        #define GLCD_DATAASOUTPUT()    _DRIVE_PORT_OUTPUT(3, 0xff)
        #define GLCD_DATAASINPUT()     _FLOAT_PORT(3, 0xff)

        #define GLCD_DATAOUT(data)     _WRITE_PORT_MASK(3, data, 0xff)
        #define GLCD_DATAIN()          _READ_PORT(3)

        #define GLCD_RS_H()            _SETBITS(3, GLCD_RS)
        #define GLCD_RS_L()            _CLEARBITS(3, GLCD_RS)

