sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
        #define GLCD_RW_H()            _SETBITS(3, GLCD_RW)
        #define GLCD_RW_L()            _CLEARBITS(3, GLCD_RW)

        #define GLCD_CS0_H()           _SETBITS(3, GLCD_CS0)  
        #define GLCD_CS0_L()           _CLEARBITS(3, GLCD_CS0)
    
        #define GLCD_CS1_H()           _SETBITS(3, GLCD_CS1)  
        #define GLCD_CS1_L()           _CLEARBITS(3, GLCD_CS1)
    
        #define GLCD_DELAY_WRITE()                                       // no write delay since the data is stable for long enough at full speed
        #define GLCD_DELAY_READ()      GLCD_RW_H()                       // one extra operation to ensure set up time of read

        #define GLCD_RST_H()           _SETBITS(3, GLCD_RST)  
        #define GLCD_RST_L()           _CLEARBITS(3, GLCD_RST)

        #define GLCD_ENA_H()           _SETBITS(3, GLCD_ENA)  
        #define GLCD_ENA_L()           _CLEARBITS(3, GLCD_ENA)

        #ifdef _WINDOWS
            #define MAX_GLCD_WRITE_BURST   1000                          // the maximum number of writes to the GLCD before the task yields
        #else
            #define MAX_GLCD_WRITE_BURST   80                            // the maximum number of writes to the GLCD before the task yields
        #endif
    #endif
#endif

// Keypad
//
#if defined KEY_COLUMNS && KEY_COLUMNS > 0                               // matrix keypad {14}
    #define KEY_ROW_IN_1              PX5
    #define KEY_ROW_IN_PORT_1         _READ_PORT(2)
    #define KEY_ROW_IN_PORT_1_REF     _GPIO_2

    #define KEY_ROW_IN_2              PX6
    #define KEY_ROW_IN_PORT_2         _READ_PORT(2)
    #define KEY_ROW_IN_PORT_2_REF     _GPIO_2

    #define KEY_ROW_IN_3              PX7
    #define KEY_ROW_IN_PORT_3         _READ_PORT(2)
    #define KEY_ROW_IN_PORT_3_REF     _GPIO_2

    #define KEY_ROW_IN_4              PX8
    #define KEY_ROW_IN_PORT_4         _READ_PORT(2)
    #define KEY_ROW_IN_PORT_4_REF     _GPIO_2

    #define KEY_COL_OUT_1             PX11
    #define KEY_COL_OUT_PORT_1        OVR_3
    #define KEY_COL_OUT_DDR_1         ODER_3

    #define KEY_COL_OUT_2             PX12
    #define KEY_COL_OUT_PORT_2        OVR_3
    #define KEY_COL_OUT_DDR_2         ODER_3

    #define KEY_COL_OUT_3             PX13
    #define KEY_COL_OUT_PORT_3        OVR_3
    #define KEY_COL_OUT_DDR_3         ODER_3

    #define KEY_COL_OUT_4             PX14
    #define KEY_COL_OUT_PORT_4        OVR_3
    #define KEY_COL_OUT_DDR_4         ODER_3

    // Drive each column low
    //
    #define DRIVE_COLUMN_1()          _DRIVE_PORT_OUTPUT(3, KEY_COL_OUT_1)    // drive output low (column 1) - this will drive a '0' since the output has been prepared
    #define DRIVE_COLUMN_2()          _DRIVE_PORT_OUTPUT(3, KEY_COL_OUT_2)    // drive output low (column 2) - this will drive a '0' since the output has been prepared
    #define DRIVE_COLUMN_3()          _DRIVE_PORT_OUTPUT(3, KEY_COL_OUT_3)    // drive output low (column 3) - this will drive a '0' since the output has been prepared
    #define DRIVE_COLUMN_4()          _DRIVE_PORT_OUTPUT(3, KEY_COL_OUT_4)    // drive output low (column 4) - this will drive a '0' since the output has been prepared

    // Drive high (to avoid slow rise time) then set back as input
    //
    #define RELEASE_COLUMN_1()        _SETBITS(3, KEY_COL_OUT_1); _FLOAT_PORT(3, KEY_COL_OUT_1)
    #define RELEASE_COLUMN_2()        _SETBITS(3, KEY_COL_OUT_2); _FLOAT_PORT(3, KEY_COL_OUT_2)
    #define RELEASE_COLUMN_3()        _SETBITS(3, KEY_COL_OUT_3); _FLOAT_PORT(3, KEY_COL_OUT_3)
    #define RELEASE_COLUMN_4()        _SETBITS(3, KEY_COL_OUT_4); _FLOAT_PORT(3, KEY_COL_OUT_4)

    // Reset any changes ready for next scan sequence
    //
    #define RESET_SCAN()              _CLEARBITS(3, (KEY_COL_OUT_1 | KEY_COL_OUT_2 | KEY_COL_OUT_3 | KEY_COL_OUT_4)); // prepare outputs low for next time

    // Key scan initialisation
    //
    #define INIT_KEY_SCAN()          _CONFIG_PORT_INPUT(3, (KEY_COL_OUT_1 | KEY_COL_OUT_2 | KEY_COL_OUT_3 | KEY_COL_OUT_4)); \
                                     _CONFIG_PORT_INPUT(2, (KEY_ROW_IN_1 | KEY_ROW_IN_2 | KEY_ROW_IN_3 | KEY_ROW_IN_4)); \
                                      RESET_SCAN()

    // LEDs
    //
    #define KEYPAD_LEDS  4

                                    // '0'            '1'    input state center (x,   y)   0 = circle, radius, controlling port, controlling pin 
    #define KEYPAD_LED_DEFINITIONS  {RGB(215,215,215),RGB(255,0,0), 1, {265, 20,  0,   7 },   _GPIO_0, PA05}, \
                                    {RGB(215,215,215),RGB(0,255,0), 1, {265, 88,  0,   7 },   _GPIO_0, PA06}, \
                                    {RGB(215,215,215),RGB(0,0,255), 1, {265, 156, 0,   7 },   _GPIO_1, PA28}, \
                                    {RGB(215,215,215),RGB(255,0,0), 1, {260, 216, 270, 226 }, _GPIO_1, PA27}
#elif defined KEY_COLUMNS && KEY_COLUMNS == 0                            // linear keyboard (key connected directly to inputs) {14}
    #define KEY_ROW_IN_1            PX5
    #define KEY_1_PORT_REF          _GPIO_2

    #define KEY_ROW_IN_2            PX6
    #define KEY_2_PORT_REF          _GPIO_2

    #define KEY_ROW_IN_3            PX7
    #define KEY_3_PORT_REF          _GPIO_2

    #define KEY_ROW_IN_4            PX8
    #define KEY_4_PORT_REF          _GPIO_2

    #define INIT_KEY_STATE          ((KEY_ROW_IN_1 | KEY_ROW_IN_2 | KEY_ROW_IN_3 | KEY_ROW_IN_4) >> 28)

    #define KEY_1_PORT_PIN          KEY_ROW_IN_1
    #define KEY_2_PORT_PIN          KEY_ROW_IN_2
    #define KEY_3_PORT_PIN          KEY_ROW_IN_3
    #define KEY_4_PORT_PIN          KEY_ROW_IN_4

    #define READ_KEY_INPUTS()       (_READ_PORT_MASK(2, (KEY_ROW_IN_1 | KEY_ROW_IN_2 | KEY_ROW_IN_3 | KEY_ROW_IN_4)) >> 28)

    #define INIT_KEY_SCAN()         _CONFIG_PORT_INPUT(2, (KEY_ROW_IN_1 | KEY_ROW_IN_2 | KEY_ROW_IN_3 | KEY_ROW_IN_4))

    // LEDs
    //
    #define KEYPAD_LEDS  4

                                    // '0'            '1'    input state center (x,   y)   0 = circle, radius, controlling port, controlling pin 
    #define KEYPAD_LED_DEFINITIONS  {RGB(215,215,215),RGB(255,0,0), 1, {265, 20,  0,   7 },   _GPIO_0, PA05}, \
                                    {RGB(215,215,215),RGB(0,255,0), 1, {265, 88,  0,   7 },   _GPIO_0, PA06}, \
                                    {RGB(215,215,215),RGB(0,0,255), 1, {265, 156, 0,   7 },   _GPIO_1, PA28}, \
                                    {RGB(215,215,215),RGB(255,0,0), 1, {260, 216, 270, 226 }, _GPIO_1, PA27}
#else                                                                    // no keys but use LEDs when a frontpanel is defined
    // LEDs
    //
    #if defined AVR32_EVK1105
        #define KEYPAD_LEDS  4
        #define KEYPAD "KeyPads/EVK1105.bmp"

                                        // '0'            '1'    input state  center (x,   y)   0 = circle, radius, controlling port, controlling pin 
        #define KEYPAD_LED_DEFINITIONS  {RGB(190,190,190),RGB(50,255,0), 1, {52,  296, 62,  304 }, _GPIO_1, PA27}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {87,  296, 97,  304 }, _GPIO_1, PA28}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {141, 296, 151, 304 }, _GPIO_0, PA06}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {188, 296, 198, 304 }, _GPIO_0, PA05}

        #define BUTTON_KEY_DEFINITIONS  {PORT_0, TOUCH_DETECT, {283, 259, 431, 407}}, \
                                        {PORT_1, TOUCH_LEFT,   {278, 314, 319, 349}}, \
                                        {PORT_1, TOUCH_RIGHT,  {391, 314, 429, 349}}, \
                                        {PORT_1, TOUCH_UP,     {335, 255, 373, 293}}, \
                                        {PORT_1, TOUCH_DOWN,   {335, 366, 373, 406}}, \
                                        {PORT_1, TOUCH_ENTER,  {335, 314, 373, 349}}

