sWahlinRhoades/uTaskerModified/Applications/uTaskerV1.4/app_hw_AVR32.h
    #elif defined AVR32_EVK1101
        #define KEYPAD_LEDS  4
        #define KEYPAD "KeyPads/EVK1101.bmp"

                                        // '0'            '1'    input state center (x,   y)   0 = circle, radius, controlling port, controlling pin 
        #define KEYPAD_LED_DEFINITIONS  {RGB(190,190,190),RGB(50,255,0), 1, {70,  320, 83,  327 }, _GPIO_0, PA07}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {88,  320, 101, 327 }, _GPIO_0, PA08}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {109, 320, 122, 327 }, _GPIO_0, PA21}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {129, 320, 142, 327 }, _GPIO_0, PA22}

        #define BUTTON_KEY_DEFINITIONS  {PORT_1, SWITCH_PB0, {159, 333, 170, 344}}, \
                                        {PORT_1, SWITCH_PB1, {159, 365, 170, 377}}, \
                                        {PORT_0, JOY_STICK_CTR, {100, 351, 112, 364}}, \
                                        {PORT_1, JOY_STICK_A, {86, 341, 94, 374}}, \
                                        {PORT_1, JOY_STICK_B, {86, 341, 124,350}}, \
                                        {PORT_1, JOY_STICK_C, {116,338, 130,374}}, \
                                        {PORT_1, JOY_STICK_D, {86, 364, 126,374}},
    #elif defined AVR32_AT32UC3C_EK
        #define KEYPAD_LEDS  4
        #define KEYPAD "KeyPads/AT32UC3C-EK.bmp"

                                        // '0'            '1'    input state center (x,   y)   0 = circle, radius, controlling port, controlling pin 
        #define KEYPAD_LED_DEFINITIONS  {RGB(190,190,190),RGB(50,255,0), 1, {66,  231, 78,  237 }, _GPIO_0, DEMO_LED_1}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {93,  231, 106, 237 }, _GPIO_2, DEMO_LED_2}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {122, 231, 130, 237 }, _GPIO_3, DEMO_LED_3}, \
                                        {RGB(190,190,190),RGB(50,255,0), 1, {147, 231, 156, 237 }, _GPIO_3, DEMO_LED_4}

        #define BUTTON_KEY_DEFINITIONS  {PORT_0, SWITCH_PB0, {55,  342, 65,  353}}, \
                                        {PORT_0, SWITCH_PB1, {142, 342, 154, 353}}
    #elif defined AVR32_UC3_C2_XPLAINED                                  // {16}
        #define KEYPAD_LEDS  1
        #define KEYPAD "KeyPads/UC3-C2Xplained.bmp"

                                        // '0'            '1'    input state  center (x,   y)   0 = circle, radius, controlling port, controlling pin 
        #define KEYPAD_LED_DEFINITIONS  {RGB(255,255,0),RGB(190,190,190), 1, {383, 55, 391, 70 }, _GPIO_3, PD21}

        #define BUTTON_KEY_DEFINITIONS  {PORT_2, BUTTON0, {16, 54, 50, 87}}, \
                                        {PORT_0, BUTTON1, {16, 194, 50, 228}}
    #endif
#endif

//#define BUZZER_SOUND                                                   // enable buzzer sound generation in the simulator (needs Winmm.lib added to the simulator linker setting)


// Internal HTML message pages
//
#define SUPPORT_INTERNAL_HTML_FILES                                      // enable the use of the following files
#define UPLOAD_FAILED             "<html><head><title>SW Upload failed</title></head><body bgcolor=#ff9000 text=#000000 topmargin=3 marginheight=3><center><td valign=top class=h><font color=#ff0000 style=font-size:30px><b style='mso-bidi-font-weight:normal'>&micro;Tasker</font></i></b></td><br></td><td align=left><br><br>Sorry but upload has failed.</font><br><br><a href=""javascript:history.back()"">Return</a></body></html>"
#define SW_UPLOAD_COMPLETED       "<html><head><meta http-equiv=""refresh"" content=""10;URL=0Menu.htm""><title>AVR32 SW Uploaded</title></head><body bgcolor=#ffffff text=#000000 topmargin=3 marginheight=3><center><td valign=top class=h><font color=#ff0000 style=font-size:30px><b style='mso-bidi-font-weight:normal'>&micro;Tasker</font> - SW Update</i></b></td><br></td><td align=left><br><br>SW Upload successful. The AVR32 target will now reset and start the new program. Please wait 10s...</body></html>"

#ifdef USE_TFTP
    #define TFTP_ERROR_MESSAGE    "uTasker AVR32 TFTP Error"             // fixed TFTP error test
#endif

#endif

#endif
